DataProcessors/ДашбордРуководителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ДашбордРуководителя</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ОбъектыВРаботе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОбъектыВРаботе</Name>
			<Comment>Трейд Софт</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗадолженностьПоОбъектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностьПоОбъектам</Name>
			<Comment>Трейд Софт Задолженность по долговому обязательству</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДО</Name>
					<Comment>Сумма задолженности в валюте долгового обязательства</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма задолженности в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДолгДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДолгРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентыДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентыРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрафыДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрафыРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПениДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПениРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая1ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая1Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая2ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая2Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая3ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая3Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая4ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая4Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая5ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая5Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая6ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая6Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая7ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая7Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая8ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая8Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДвиженияЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Comment>Дополнительная аналитика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоДоговорам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентыНачисленныеВПериодПросрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Штрафы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДолгГрафик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентыГрафик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентыНачисления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрафыНачисления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПениНачисления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийПоРасчетам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Займ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/ДашбордРуководителя/Ext/ObjectModule.bsl
Процедура ЗапросыДашБорд(ДиаграммаКоличествоДоговоров, ДиаграммаКоличествоМероприятий, 
								ДиаграммаЗадолженностьСтадия, ДиаграммаЗадолженностьКредиторы) Экспорт
	ЗапросКоличествоДоговоров(ДиаграммаКоличествоДоговоров);  
	ЗапросКоличествоМероприятий(ДиаграммаКоличествоМероприятий); 
	ЗапросЗадолженностьСтадия(ДиаграммаЗадолженностьСтадия); 
	ЗапросЗадолженностьКредитор(ДиаграммаЗадолженностьКредиторы);
КонецПроцедуры  

Процедура ЗапросыДашБордФильтрКредитор(ФильтрКредитор, ДиаграммаЗадолженностьФильтрКредитор, ДиаграммаКоличествоДоговоровФильтрКредитор) Экспорт
	
 	ЗапросЗадолженностьФильтрКредитор(ФильтрКредитор, ДиаграммаЗадолженностьФильтрКредитор);
    ЗапросКоличествоДоговоровФильтрКредитор(ФильтрКредитор, ДиаграммаКоличествоДоговоровФильтрКредитор);
КонецПроцедуры 

Процедура ЗапросыДашБордФильтрБП(ФильтрБП, ДиаграммаКоличествоМероприятийФильтрБП) Экспорт
	
 	ЗапросКоличествоМероприятийФильтрБП(ФильтрБП, ДиаграммаКоличествоМероприятийФильтрБП);
    
КонецПроцедуры  

Процедура ЗапросКоличествоДоговоров(ДиаграммаКоличествоДоговоров) Экспорт		
	ДиаграммаКоличествоДоговоров.Очистить();  
	 	
	ЗапросКоличествоПоКредиторам = Новый Запрос;
	ЗапросКоличествоПоКредиторам.Текст = 
		"ВЫБРАТЬ
		|	СУММА(1) КАК КоличествоВБазе,
		|	ДолговыеОбязательства.Кредитор КАК Кредитор
		|ПОМЕСТИТЬ ВсегоВБазеДО
		|ИЗ
		|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
		|
		|СГРУППИРОВАТЬ ПО
		|	ДолговыеОбязательства.Кредитор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(1) КАК КоличествоВработе,
		|	ОбъектыВРаботеОстатки.Объект.Кредитор КАК ОбъектКредитор
		|ПОМЕСТИТЬ ВРаботе
		|ИЗ
		|	РегистрНакопления.ОбъектыВРаботе.Остатки КАК ОбъектыВРаботеОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбъектыВРаботеОстатки.Объект.Кредитор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВсегоВБазеДО.Кредитор = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ""Нет Данных""
		|		ИНАЧЕ ВсегоВБазеДО.Кредитор
		|	КОНЕЦ КАК Кредитор,
		|	ВсегоВБазеДО.КоличествоВБазе КАК КоличествоВБазе,
		|	ЕСТЬNULL(ВРаботе.КоличествоВработе, 0) КАК КоличествоВработе,
		|	ВсегоВБазеДО.КоличествоВБазе - ЕСТЬNULL(ВРаботе.КоличествоВработе, 0) КАК КоличествоЗакрытых
		|ИЗ
		|	ВсегоВБазеДО КАК ВсегоВБазеДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВРаботе КАК ВРаботе
		|		ПО ВсегоВБазеДО.Кредитор = ВРаботе.ОбъектКредитор
		|{ГДЕ
		|	(ВсегоВБазеДО.Кредитор = &Кредитор) КАК Поле2}
		|
		|УПОРЯДОЧИТЬ ПО
		|	КоличествоВБазе УБЫВ
		|ИТОГИ
		|	СУММА(КоличествоВБазе),
		|	СУММА(КоличествоВработе),
		|	СУММА(КоличествоЗакрытых)
		|ПО
		|	ОБЩИЕ";  
	
	//ЗапросКоличествоПоКредиторам.УстановитьПараметр("Кредитор", знчКредитор);
	
	РезультатЗапроса = ЗапросКоличествоПоКредиторам.Выполнить();
	
	ВыборкаКоличествоПоКредиторам = РезультатЗапроса.Выбрать(); 
	
	СерияКоличествоВБазе = ДиаграммаКоличествоДоговоров.Серии.Добавить("В базе");
	СерияКоличествоВработе = ДиаграммаКоличествоДоговоров.Серии.Добавить("В работе");
	СерияКоличествоЗакрытых = ДиаграммаКоличествоДоговоров.Серии.Добавить("Закрытых");
	
	Пока ВыборкаКоличествоПоКредиторам.Следующий() Цикл
			
		ТочкаКредитор = ДиаграммаКоличествоДоговоров.УстановитьТочку(?(ЗначениеЗаполнено(ВыборкаКоличествоПоКредиторам.Кредитор),Строка(ВыборкаКоличествоПоКредиторам.Кредитор),"ВСЕГО"));
		ДиаграммаКоличествоДоговоров.УстановитьЗначение(ТочкаКредитор, СерияКоличествоВБазе, ВыборкаКоличествоПоКредиторам.КоличествоВБазе);
		ДиаграммаКоличествоДоговоров.УстановитьЗначение(ТочкаКредитор, СерияКоличествоВработе, ВыборкаКоличествоПоКредиторам.КоличествоВработе);
		ДиаграммаКоличествоДоговоров.УстановитьЗначение(ТочкаКредитор, СерияКоличествоЗакрытых, ВыборкаКоличествоПоКредиторам.КоличествоЗакрытых);
	КонецЦикла;

	
КонецПроцедуры

Процедура ЗапросКоличествоМероприятий(ДиаграммаКоличествоМероприятий) Экспорт		
	ДиаграммаКоличествоМероприятий.Очистить(); 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Мероприятие.Схема, ""Вне процесса"") КАК БизнесПроцессСхема,
		|	СУММА(1) КАК Запланировано
		|ПОМЕСТИТЬ КоличествоМероприятий
		|ИЗ
		|	Задача.Мероприятие КАК Мероприятие
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(Мероприятие.Схема, ""Вне процесса"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Мероприятие.Схема, ""Вне процесса"") КАК БизнесПроцессСхема,
		|	СУММА(1) КАК Выполненные
		|ПОМЕСТИТЬ КоличествоВыполненных
		|ИЗ
		|	Задача.Мероприятие КАК Мероприятие
		|ГДЕ
		|	Мероприятие.Выполнена
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(Мероприятие.Схема, ""Вне процесса"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(Мероприятие.Схема, ""Вне процесса"") КАК Процесс,
		|	Мероприятие.Объект КАК Объект,
		|	МАКСИМУМ(1) КАК КолВоОбъектов
		|ПОМЕСТИТЬ ОбъектыНаСтадии
		|ИЗ
		|	Задача.Мероприятие КАК Мероприятие
		|ГДЕ
		|	НЕ Мероприятие.БизнесПроцесс.Завершен
		|
		|СГРУППИРОВАТЬ ПО
		|	Мероприятие.Объект,
		|	ЕСТЬNULL(Мероприятие.Схема, ""Вне процесса"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбъектыНаСтадии.Процесс КАК Процесс,
		|	СУММА(ОбъектыНаСтадии.КолВоОбъектов) КАК КолВоОбъектов,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбъектыНаСтадии.Объект) КАК Объект
		|ПОМЕСТИТЬ КоличествоОбъектовНаСтадии
		|ИЗ
		|	ОбъектыНаСтадии КАК ОбъектыНаСтадии
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбъектыНаСтадии.Процесс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА КоличествоМероприятий.БизнесПроцессСхема = ЗНАЧЕНИЕ(Справочник.КартыМаршрутов.ПустаяСсылка)
		|			ТОГДА ""Вне процесса""
		|		ИНАЧЕ КоличествоМероприятий.БизнесПроцессСхема
		|	КОНЕЦ КАК Процесс,
		|	КоличествоМероприятий.Запланировано КАК Запланировано,
		|	КоличествоВыполненных.Выполненные КАК Выполненные,
		|	ЕСТЬNULL(КоличествоОбъектовНаСтадии.КолВоОбъектов, 0) КАК КолВоОбъектов
		|ИЗ
		|	КоличествоМероприятий КАК КоличествоМероприятий
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоВыполненных КАК КоличествоВыполненных
		|		ПО КоличествоМероприятий.БизнесПроцессСхема = КоличествоВыполненных.БизнесПроцессСхема
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоОбъектовНаСтадии КАК КоличествоОбъектовНаСтадии
		|		ПО КоличествоМероприятий.БизнесПроцессСхема = КоличествоОбъектовНаСтадии.Процесс";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СерияЗапланировано = ДиаграммаКоличествоМероприятий.Серии.Добавить("Запланированные мероприятия");
	СерияВыполненно = ДиаграммаКоличествоМероприятий.Серии.Добавить("Из них выполненные");
	СерияОбъекты = ДиаграммаКоличествоМероприятий.Серии.Добавить("Долги на стадии");

	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТочкаПроцесс = ДиаграммаКоличествоМероприятий.УстановитьТочку(?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Процесс),Строка(ВыборкаДетальныеЗаписи.Процесс),"ВСЕГО"));
		ДиаграммаКоличествоМероприятий.УстановитьЗначение(ТочкаПроцесс, СерияЗапланировано, ВыборкаДетальныеЗаписи.Запланировано);
		ДиаграммаКоличествоМероприятий.УстановитьЗначение(ТочкаПроцесс, СерияВыполненно, ВыборкаДетальныеЗаписи.Выполненные);
		ДиаграммаКоличествоМероприятий.УстановитьЗначение(ТочкаПроцесс, СерияОбъекты, ВыборкаДетальныеЗаписи.КолВоОбъектов);
	КонецЦикла;
	
	
	
КонецПроцедуры

Процедура ЗапросЗадолженностьСтадия(ДиаграммаЗадолженностьСтадия) Экспорт		
	ДиаграммаЗадолженностьСтадия.Очистить(); 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЗадолженностьПоОбъектамОстатки.СуммаДООстаток, 0) КАК СтарыйОстаток
		|ПОМЕСТИТЬ СтарыеОстатки
		|ИЗ
		|	РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(&ДатаОстатков, ) КАК ЗадолженностьПоОбъектамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(РасчетыПоДоговорамОстатки.ОсновнойДолгОстаток + РасчетыПоДоговорамОстатки.ПроцентыОстаток + РасчетыПоДоговорамОстатки.ПроцентыНачисленныеВПериодПросрочкиОстаток + РасчетыПоДоговорамОстатки.ШтрафыОстаток + РасчетыПоДоговорамОстатки.ПениОстаток, 0) КАК РасчетыОстаток
		|ПОМЕСТИТЬ Расчеты
		|ИЗ
		|	РегистрНакопления.РасчетыПоДоговорам.Остатки(&ДатаОстатков, ) КАК РасчетыПоДоговорамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЗадолженностьПоОбъектамВнесудебнаяОстатки.СуммаДООстаток, 0) КАК ВнесудОстаток
		|ПОМЕСТИТЬ Внесудебка
		|ИЗ
		|	РегистрНакопления.ЗадолженностьПоОбъектамВнесудебная.Остатки(&ДатаОстатков, ) КАК ЗадолженностьПоОбъектамВнесудебнаяОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЗадолженностьПоСудебнымРешениямОстатки.СуммаОстаток, 0) КАК СудебкаОстаток
		|ПОМЕСТИТЬ Судебка
		|ИЗ
		|	РегистрНакопления.ЗадолженностьПоСудебнымРешениям.Остатки(&ДатаОстатков, ) КАК ЗадолженностьПоСудебнымРешениямОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ИсковыеТребованияОстатки.ЦенаИскаОстаток, 0) КАК ИсковыеТребования
		|ПОМЕСТИТЬ Иски
		|ИЗ
		|	РегистрНакопления.ИсковыеТребования.Остатки(&ДатаОстатков, ) КАК ИсковыеТребованияОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СтарыеОстатки.СтарыйОстаток, 0) КАК БезКатегории,
		|	ЕСТЬNULL(Расчеты.РасчетыОстаток, 0) КАК График,
		|	ЕСТЬNULL(Внесудебка.ВнесудОстаток, 0) КАК Досудебная,
		|	ЕСТЬNULL(Судебка.СудебкаОстаток, 0) КАК Исполнительная,
		|	ЕСТЬNULL(Иски.ИсковыеТребования, 0) КАК ПоданоВСуд,
		|	ЕСТЬNULL(СтарыеОстатки.СтарыйОстаток, 0) + ЕСТЬNULL(Расчеты.РасчетыОстаток, 0) + ЕСТЬNULL(Внесудебка.ВнесудОстаток, 0) + ЕСТЬNULL(Судебка.СудебкаОстаток, 0) КАК Итого
		|ИЗ
		|	СтарыеОстатки КАК СтарыеОстатки,
		|	Расчеты КАК Расчеты,
		|	Внесудебка КАК Внесудебка,
		|	Судебка КАК Судебка,
		|	Иски КАК Иски";
	
	Запрос.УстановитьПараметр("ДатаОстатков", ТекущаяДатаСеанса());
	РезультатЗапроса = Запрос.Выполнить();
	Если Константы.ИспользоватьСтандарныйУчетЗадолженности.Получить() Тогда
		СерияБезКатегории = ДиаграммаЗадолженностьСтадия.Серии.Добавить("Без категории");
	КонецЕсли;  
	Если Константы.РасчетНачислений.Получить() Тогда
		СерияГрафик = ДиаграммаЗадолженностьСтадия.Серии.Добавить("Досудебная расчетная"); 
	КонецЕсли; 
	
	Если Константы.ИспользоватьСудебныйБлок.Получить() Тогда
		СерияДосудебка = ДиаграммаЗадолженностьСтадия.Серии.Добавить("Досудебная Остатки");
		СерияИск = ДиаграммаЗадолженностьСтадия.Серии.Добавить("Подано в суд"); 
		СерияИспол = ДиаграммаЗадолженностьСтадия.Серии.Добавить("Просужено");
	КонецЕсли;
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		Если Константы.ИспользоватьСтандарныйУчетЗадолженности.Получить() Тогда
			ДиаграммаЗадолженностьСтадия.УстановитьЗначение(ДиаграммаЗадолженностьСтадия.УстановитьТочку(1), СерияБезКатегории, ВыборкаДетальныеЗаписи.БезКатегории);
		КонецЕсли;   
		Если Константы.РасчетНачислений.Получить() Тогда
			ДиаграммаЗадолженностьСтадия.УстановитьЗначение(ДиаграммаЗадолженностьСтадия.УстановитьТочку(1), СерияГрафик, ВыборкаДетальныеЗаписи.График);
		КонецЕсли;
		Если Константы.ИспользоватьСудебныйБлок.Получить() Тогда
			ДиаграммаЗадолженностьСтадия.УстановитьЗначение(ДиаграммаЗадолженностьСтадия.УстановитьТочку(1), СерияДосудебка, ВыборкаДетальныеЗаписи.Досудебная);
			ДиаграммаЗадолженностьСтадия.УстановитьЗначение(ДиаграммаЗадолженностьСтадия.УстановитьТочку(1), СерияИск, ВыборкаДетальныеЗаписи.ПоданоВСуд);
			ДиаграммаЗадолженностьСтадия.УстановитьЗначение(ДиаграммаЗадолженностьСтадия.УстановитьТочку(1), СерияИспол, ВыборкаДетальныеЗаписи.Исполнительная); 
		КонецЕсли;
	КонецЦикла;
	
	
	
КонецПроцедуры

Процедура ЗапросЗадолженностьКредитор(ДиаграммаЗадолженностьКредиторы) Экспорт		
	ДиаграммаЗадолженностьКредиторы.Очистить(); 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбъектыВРаботеОстатки.Объект КАК ДО,
		|	ЕСТЬNULL(ЗадолженностьПоОбъектамВнесудебнаяОбороты.СуммаДОПриход, 0) КАК НачисленоВнесуд,
		|	ЕСТЬNULL(ЗадолженностьПоСудебнымРешениямОбороты.СуммаПриход, 0) КАК НачисленоСуд
		|ПОМЕСТИТЬ Начисления
		|ИЗ
		|	РегистрНакопления.ОбъектыВРаботе.Остатки КАК ОбъектыВРаботеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектамВнесудебная.Обороты КАК ЗадолженностьПоОбъектамВнесудебнаяОбороты
		|		ПО ОбъектыВРаботеОстатки.Объект = ЗадолженностьПоОбъектамВнесудебнаяОбороты.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоСудебнымРешениям.Обороты КАК ЗадолженностьПоСудебнымРешениямОбороты
		|		ПО ОбъектыВРаботеОстатки.Объект = ЗадолженностьПоСудебнымРешениямОбороты.Займ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеПлатежа.Займ КАК Займ,
		|	СУММА(ПоступлениеПлатежа.СуммаПлатежа) КАК СуммаПлатежа
		|ПОМЕСТИТЬ Платежи
		|ИЗ
		|	Документ.ПоступлениеПлатежа КАК ПоступлениеПлатежа
		|ГДЕ
		|	НЕ ПоступлениеПлатежа.ПометкаУдаления
		|	И ПоступлениеПлатежа.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеПлатежа.Займ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеПлатежейОбъекты.Объект,
		|	СУММА(ПоступлениеПлатежейОбъекты.ОсновнойДолг + ПоступлениеПлатежейОбъекты.Проценты + ПоступлениеПлатежейОбъекты.Штрафы + ПоступлениеПлатежейОбъекты.Пени + ПоступлениеПлатежейОбъекты.Составляющая1 + ПоступлениеПлатежейОбъекты.Составляющая2 + ПоступлениеПлатежейОбъекты.Составляющая3 + ПоступлениеПлатежейОбъекты.Составляющая4 + ПоступлениеПлатежейОбъекты.Составляющая5 + ПоступлениеПлатежейОбъекты.Составляющая6 + ПоступлениеПлатежейОбъекты.Составляющая7 + ПоступлениеПлатежейОбъекты.Составляющая8)
		|ИЗ
		|	Документ.ПоступлениеПлатежей.Объекты КАК ПоступлениеПлатежейОбъекты
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеПлатежейОбъекты.Объект
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Займ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбъектыВРаботеОстатки.Объект КАК ДОоб,
		|	ЕСТЬNULL(ЗадолженностьПоОбъектамВнесудебнаяОстатки.СуммаДООстаток, 0) + ЕСТЬNULL(ЗадолженностьПоСудебнымРешениямОстатки.СуммаОстаток, 0) КАК Остаток
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.ОбъектыВРаботе.Остатки КАК ОбъектыВРаботеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектамВнесудебная.Остатки КАК ЗадолженностьПоОбъектамВнесудебнаяОстатки
		|		ПО ОбъектыВРаботеОстатки.Объект = ЗадолженностьПоОбъектамВнесудебнаяОстатки.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоСудебнымРешениям.Остатки КАК ЗадолженностьПоСудебнымРешениямОстатки
		|		ПО ОбъектыВРаботеОстатки.Объект = ЗадолженностьПоСудебнымРешениямОстатки.Займ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Начисления.ДО.Кредитор = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ""Нет Данных""
		|		ИНАЧЕ Начисления.ДО.Кредитор
		|	КОНЕЦ КАК ДОКредитор,
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.НачисленоВнесуд <= 0
		|				ТОГДА Начисления.НачисленоСуд
		|			ИНАЧЕ Начисления.НачисленоВнесуд
		|		КОНЕЦ) КАК Начислено,
		|	СУММА(ЕСТЬNULL(Платежи.СуммаПлатежа, 0)) КАК Оплаты,
		|	СУММА(Остатки.Остаток) КАК Остаток
		|ИЗ
		|	Начисления КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Платежи КАК Платежи
		|		ПО Начисления.ДО = Платежи.Займ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
		|		ПО Начисления.ДО = Остатки.ДОоб
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА Начисления.ДО.Кредитор = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ""Нет Данных""
		|		ИНАЧЕ Начисления.ДО.Кредитор
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Начислено УБЫВ
		|ИТОГИ
		|	СУММА(Начислено),
		|	СУММА(Оплаты),
		|	СУММА(Остаток)
		|ПО
		|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("ДатаОстатков", ТекущаяДатаСеанса());
	РезультатЗапроса = Запрос.Выполнить();
	
	СерияНачислено = ДиаграммаЗадолженностьКредиторы.Серии.Добавить("Поступившая Задолженность");
	СерияОплачено = ДиаграммаЗадолженностьКредиторы.Серии.Добавить("Оплачено");
	СерияОстаток = ДиаграммаЗадолженностьКредиторы.Серии.Добавить("Остаток");
	
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТочкаКредитор = ДиаграммаЗадолженностьКредиторы.УстановитьТочку(?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДОКредитор),Строка(ВыборкаДетальныеЗаписи.ДОКредитор),"ВСЕГО"));
		ДиаграммаЗадолженностьКредиторы.УстановитьЗначение(ТочкаКредитор, СерияНачислено, ВыборкаДетальныеЗаписи.Начислено);
		ДиаграммаЗадолженностьКредиторы.УстановитьЗначение(ТочкаКредитор, СерияОплачено, ВыборкаДетальныеЗаписи.Оплаты);
		ДиаграммаЗадолженностьКредиторы.УстановитьЗначение(ТочкаКредитор, СерияОстаток, ВыборкаДетальныеЗаписи.Остаток);
	КонецЦикла;
	
	
	
КонецПроцедуры

Процедура ЗапросЗадолженностьФильтрКредитор(ФильтрКредитор, ДиаграммаЗадолженностьФильтрКредитор) Экспорт		
	ДиаграммаЗадолженностьФильтрКредитор.Очистить(); 
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбъектыВРаботеОстатки.Объект КАК ДО,
		|	ЕСТЬNULL(ЗадолженностьПоОбъектамВнесудебнаяОбороты.СуммаДОПриход, 0) КАК НачисленоВнесуд,
		|	ЕСТЬNULL(ЗадолженностьПоСудебнымРешениямОбороты.СуммаПриход, 0) КАК НачисленоСуд
		|ПОМЕСТИТЬ Начисления
		|ИЗ
		|	РегистрНакопления.ОбъектыВРаботе.Остатки КАК ОбъектыВРаботеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектамВнесудебная.Обороты КАК ЗадолженностьПоОбъектамВнесудебнаяОбороты
		|		ПО ОбъектыВРаботеОстатки.Объект = ЗадолженностьПоОбъектамВнесудебнаяОбороты.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоСудебнымРешениям.Обороты КАК ЗадолженностьПоСудебнымРешениямОбороты
		|		ПО ОбъектыВРаботеОстатки.Объект = ЗадолженностьПоСудебнымРешениямОбороты.Займ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеПлатежа.Займ КАК Займ,
		|	СУММА(ПоступлениеПлатежа.СуммаПлатежа) КАК СуммаПлатежа
		|ПОМЕСТИТЬ Платежи
		|ИЗ
		|	Документ.ПоступлениеПлатежа КАК ПоступлениеПлатежа
		|ГДЕ
		|	НЕ ПоступлениеПлатежа.ПометкаУдаления
		|	И ПоступлениеПлатежа.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеПлатежа.Займ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Займ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбъектыВРаботеОстатки.Объект КАК ДОоб,
		|	ЕСТЬNULL(ЗадолженностьПоОбъектамВнесудебнаяОстатки.СуммаДООстаток, 0) + ЕСТЬNULL(ЗадолженностьПоСудебнымРешениямОстатки.СуммаОстаток, 0) КАК Остаток
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.ОбъектыВРаботе.Остатки КАК ОбъектыВРаботеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектамВнесудебная.Остатки КАК ЗадолженностьПоОбъектамВнесудебнаяОстатки
		|		ПО ОбъектыВРаботеОстатки.Объект = ЗадолженностьПоОбъектамВнесудебнаяОстатки.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоСудебнымРешениям.Остатки КАК ЗадолженностьПоСудебнымРешениямОстатки
		|		ПО ОбъектыВРаботеОстатки.Объект = ЗадолженностьПоСудебнымРешениямОстатки.Займ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Начисления.ДО.Кредитор КАК ДОКредитор,
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.НачисленоВнесуд <= 0
		|				ТОГДА Начисления.НачисленоСуд
		|			ИНАЧЕ Начисления.НачисленоВнесуд
		|		КОНЕЦ) КАК Начислено,
		|	СУММА(ЕСТЬNULL(Платежи.СуммаПлатежа, 0)) КАК Оплаты,
		|	СУММА(Остатки.Остаток) КАК Остаток
		|ИЗ
		|	Начисления КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Платежи КАК Платежи
		|		ПО Начисления.ДО = Платежи.Займ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
		|		ПО Начисления.ДО = Остатки.ДОоб
		|ГДЕ
		|	Начисления.ДО.Кредитор = &Кредитор
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.ДО.Кредитор";
	
	Запрос.УстановитьПараметр("ДатаОстатков", ТекущаяДатаСеанса()); 
	Запрос.УстановитьПараметр("Кредитор", ?(ЗначениеЗаполнено(ФильтрКредитор), ФильтрКредитор, Справочники.Контрагенты.ПустаяСсылка()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СерияНачислено = ДиаграммаЗадолженностьФильтрКредитор.Серии.Добавить("Поступившая Задолженность");
	СерияОплачено = ДиаграммаЗадолженностьФильтрКредитор.Серии.Добавить("Оплачено");
	СерияОстаток = ДиаграммаЗадолженностьФильтрКредитор.Серии.Добавить("Остаток");
	
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТочкаКредитор = ДиаграммаЗадолженностьФильтрКредитор.УстановитьТочку(?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДОКредитор),Строка(ВыборкаДетальныеЗаписи.ДОКредитор),"Нет данных"));
		ДиаграммаЗадолженностьФильтрКредитор.УстановитьЗначение(ТочкаКредитор, СерияНачислено, ВыборкаДетальныеЗаписи.Начислено);
		ДиаграммаЗадолженностьФильтрКредитор.УстановитьЗначение(ТочкаКредитор, СерияОплачено, ВыборкаДетальныеЗаписи.Оплаты);
		ДиаграммаЗадолженностьФильтрКредитор.УстановитьЗначение(ТочкаКредитор, СерияОстаток, ВыборкаДетальныеЗаписи.Остаток);
	КонецЦикла;
	
	
	
КонецПроцедуры       

Процедура ЗапросКоличествоДоговоровФильтрКредитор(ФильтрКредитор, ДиаграммаКоличествоДоговоровФильтрКредитор) Экспорт		
	ДиаграммаКоличествоДоговоровФильтрКредитор.Очистить();  
	 	
	ЗапросКоличествоПоКредиторам = Новый Запрос;
	ЗапросКоличествоПоКредиторам.Текст = 
		"ВЫБРАТЬ
		|	СУММА(1) КАК КоличествоВБазе,
		|	ДолговыеОбязательства.Кредитор КАК Кредитор
		|ПОМЕСТИТЬ ВсегоВБазеДО
		|ИЗ
		|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
		|
		|СГРУППИРОВАТЬ ПО
		|	ДолговыеОбязательства.Кредитор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(1) КАК КоличествоВработе,
		|	ОбъектыВРаботеОстатки.Объект.Кредитор КАК ОбъектКредитор
		|ПОМЕСТИТЬ ВРаботе
		|ИЗ
		|	РегистрНакопления.ОбъектыВРаботе.Остатки КАК ОбъектыВРаботеОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбъектыВРаботеОстатки.Объект.Кредитор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВсегоВБазеДО.Кредитор = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ""Нет Данных""
		|		ИНАЧЕ ВсегоВБазеДО.Кредитор
		|	КОНЕЦ КАК Кредитор,
		|	ВсегоВБазеДО.КоличествоВБазе КАК КоличествоВБазе,
		|	ЕСТЬNULL(ВРаботе.КоличествоВработе, 0) КАК КоличествоВработе,
		|	ВсегоВБазеДО.КоличествоВБазе - ЕСТЬNULL(ВРаботе.КоличествоВработе, 0) КАК КоличествоЗакрытых
		|ИЗ
		|	ВсегоВБазеДО КАК ВсегоВБазеДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВРаботе КАК ВРаботе
		|		ПО ВсегоВБазеДО.Кредитор = ВРаботе.ОбъектКредитор
		|ГДЕ
		|	ВсегоВБазеДО.Кредитор = &Кредитор
		|
		|УПОРЯДОЧИТЬ ПО
		|	КоличествоВБазе УБЫВ";  
	
	ЗапросКоличествоПоКредиторам.УстановитьПараметр("Кредитор", ?(ЗначениеЗаполнено(ФильтрКредитор), ФильтрКредитор, Справочники.Контрагенты.ПустаяСсылка()));
	
	РезультатЗапроса = ЗапросКоличествоПоКредиторам.Выполнить();
	
	ВыборкаКоличествоПоКредиторам = РезультатЗапроса.Выбрать(); 
	
	СерияКоличествоВБазе = ДиаграммаКоличествоДоговоровФильтрКредитор.Серии.Добавить("В базе");
	СерияКоличествоВработе = ДиаграммаКоличествоДоговоровФильтрКредитор.Серии.Добавить("В работе");
	СерияКоличествоЗакрытых = ДиаграммаКоличествоДоговоровФильтрКредитор.Серии.Добавить("Закрытых");
	
	Пока ВыборкаКоличествоПоКредиторам.Следующий() Цикл
			
		ТочкаКредитор = ДиаграммаКоличествоДоговоровФильтрКредитор.УстановитьТочку(?(ЗначениеЗаполнено(ВыборкаКоличествоПоКредиторам.Кредитор),Строка(ВыборкаКоличествоПоКредиторам.Кредитор),"ВСЕГО"));
		ДиаграммаКоличествоДоговоровФильтрКредитор.УстановитьЗначение(ТочкаКредитор, СерияКоличествоВБазе, ВыборкаКоличествоПоКредиторам.КоличествоВБазе);
		ДиаграммаКоличествоДоговоровФильтрКредитор.УстановитьЗначение(ТочкаКредитор, СерияКоличествоВработе, ВыборкаКоличествоПоКредиторам.КоличествоВработе);
		ДиаграммаКоличествоДоговоровФильтрКредитор.УстановитьЗначение(ТочкаКредитор, СерияКоличествоЗакрытых, ВыборкаКоличествоПоКредиторам.КоличествоЗакрытых);
	КонецЦикла;

	
КонецПроцедуры

Процедура ЗапросКоличествоМероприятийФильтрБП(ФильтрБП, ДиаграммаКоличествоМероприятийФильтрБП) Экспорт		
	ДиаграммаКоличествоМероприятийФильтрБП.Очистить(); 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Мероприятие.Схема, ""Вне процесса"") КАК БизнесПроцессСхема,
		|	СУММА(1) КАК Запланировано
		|ПОМЕСТИТЬ КоличествоМероприятий
		|ИЗ
		|	Задача.Мероприятие КАК Мероприятие
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(Мероприятие.Схема, ""Вне процесса"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Мероприятие.Схема, ""Вне процесса"") КАК БизнесПроцессСхема,
		|	СУММА(1) КАК Выполненные
		|ПОМЕСТИТЬ КоличествоВыполненных
		|ИЗ
		|	Задача.Мероприятие КАК Мероприятие
		|ГДЕ
		|	Мероприятие.Выполнена
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(Мероприятие.Схема, ""Вне процесса"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(Мероприятие.Схема, ""Вне процесса"") КАК Процесс,
		|	Мероприятие.Объект КАК Объект,
		|	МАКСИМУМ(1) КАК КолВоОбъектов
		|ПОМЕСТИТЬ ОбъектыНаСтадии
		|ИЗ
		|	Задача.Мероприятие КАК Мероприятие
		|ГДЕ
		|	НЕ Мероприятие.БизнесПроцесс.Завершен
		|
		|СГРУППИРОВАТЬ ПО
		|	Мероприятие.Объект,
		|	ЕСТЬNULL(Мероприятие.Схема, ""Вне процесса"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбъектыНаСтадии.Процесс КАК Процесс,
		|	СУММА(ОбъектыНаСтадии.КолВоОбъектов) КАК КолВоОбъектов,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбъектыНаСтадии.Объект) КАК Объект
		|ПОМЕСТИТЬ КоличествоОбъектовНаСтадии
		|ИЗ
		|	ОбъектыНаСтадии КАК ОбъектыНаСтадии
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбъектыНаСтадии.Процесс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА КоличествоМероприятий.БизнесПроцессСхема = ЗНАЧЕНИЕ(Справочник.КартыМаршрутов.ПустаяСсылка)
		|			ТОГДА ""Вне процесса""
		|		ИНАЧЕ КоличествоМероприятий.БизнесПроцессСхема
		|	КОНЕЦ КАК Процесс,
		|	КоличествоМероприятий.Запланировано КАК Запланировано,
		|	КоличествоВыполненных.Выполненные КАК Выполненные,
		|	ЕСТЬNULL(КоличествоОбъектовНаСтадии.КолВоОбъектов, 0) КАК КолВоОбъектов
		|ИЗ
		|	КоличествоМероприятий КАК КоличествоМероприятий
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоВыполненных КАК КоличествоВыполненных
		|		ПО КоличествоМероприятий.БизнесПроцессСхема = КоличествоВыполненных.БизнесПроцессСхема
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоОбъектовНаСтадии КАК КоличествоОбъектовНаСтадии
		|		ПО КоличествоМероприятий.БизнесПроцессСхема = КоличествоОбъектовНаСтадии.Процесс
		|ГДЕ
		|	КоличествоМероприятий.БизнесПроцессСхема = &БизнесПроцессСхема";
	
	
	Запрос.УстановитьПараметр("БизнесПроцессСхема", ?(ЗначениеЗаполнено(ФильтрБП), ФильтрБП, БизнесПроцессы.БизнесПроцессы.ПустаяСсылка()));
	РезультатЗапроса = Запрос.Выполнить(); 
	
	СерияЗапланировано = ДиаграммаКоличествоМероприятийФильтрБП.Серии.Добавить("Запланированные мероприятия");
	СерияВыполненно = ДиаграммаКоличествоМероприятийФильтрБП.Серии.Добавить("Из них выполненные");
	СерияОбъекты = ДиаграммаКоличествоМероприятийФильтрБП.Серии.Добавить("Долги на стадии");

	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТочкаПроцесс = ДиаграммаКоличествоМероприятийФильтрБП.УстановитьТочку(?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Процесс),Строка(ВыборкаДетальныеЗаписи.Процесс),"ВСЕГО"));
		ДиаграммаКоличествоМероприятийФильтрБП.УстановитьЗначение(ТочкаПроцесс, СерияЗапланировано, ВыборкаДетальныеЗаписи.Запланировано);
		ДиаграммаКоличествоМероприятийФильтрБП.УстановитьЗначение(ТочкаПроцесс, СерияВыполненно, ВыборкаДетальныеЗаписи.Выполненные);
		ДиаграммаКоличествоМероприятийФильтрБП.УстановитьЗначение(ТочкаПроцесс, СерияОбъекты, ВыборкаДетальныеЗаписи.КолВоОбъектов);
	КонецЦикла;
	
	
	
КонецПроцедуры
